fn main() {
  // let name = "gus";
  // let age: i32 = 27;
  // println!("ปีนี้คุณ {} อายุ {} แล้ว ", name, age);
  // ------------------------1-------------------

  // let product = 40;
  // let quantity = 2; 
  // let total = product * quantity;
  // println!("ซื้อสินค้า {} ชิ้น ราคาต่อชิ้น {} บาท", quantity, product);
  // println!("รวมทั้งหมด {} บาท", total); 
  // ---------------------2---------------------------

  // let score = 50;
  // if score >= 50 {
  //   println!("ผ่าน");
  // }
  // else {
  //     println!("ไม่ผ่าน");
  // }
  // ------------------------3------------------------

  // let score = 34;
  // println!("คะแนนของคุณคือ {}", score);
  // if score >=80 {
  //     println!("คุณได้เกรด A");
  // }
  // else if score >=70 {
  //     println!("คุณได้เกรด B");
  // }
  // else if score >=60 {
  //     println!("คุณได้เกรด C");
  // }
  // else if score >=50 {
  //     println!("คุณได้เกรด D");
  // }
  // else {
  //     println!("คุณได้เกรด F");
  // }
  // --------------------4----------------------

  // let arr= ["ปิ่น", "ซามูไร", "มิกิ"];
  // println!("{}", arr[1]);
  // ---------------------5-----------------------

  // let score = [45, 78, 90];
  // println!("คะแนนของคนที่ 1 คือ {}", score[0]);
  // println!("คะแนนของคนที่ 2 คือ {}", score[1]);  
  // println!("คะแนนของคนที่ 3 คือ {}", score[2]);
  // ---------------------6-----------------------

  // let food: Vec<&'static str>  = vec!["ข้าวมันไก่", "ราเมง", "ผัดกะเพรา"];
  // println!("{}", food[1]);
  // -----------------------7-------------------------

  // let score: Vec<i32> = vec![85, 62, 45];
  // let grade_score: i32 = score[2];
  // if      grade_score >=80 {
  //   println!("เกรด A");    
  // }
  // else if grade_score >=70 {
  //   println!("เกรด B");
  // }
  // else if grade_score >=60 {
  //     println!("เกรด C");
  // } 
  // else if grade_score >=50 {
  //     println!("เกรด D");
  // }
  // else {
  //     println!("เกรด F");
  // }
  // ----------------------7------------------------------

  // let price: Vec<i32> = vec![35, 50, 25];
  // let total01: i32 = 100 - price[0];
  // let total02: i32 = 100 - price[1];
  // let total03: i32 = 100 - price[2];
  // println!("ชิ้นที่ 1 ราคา {} บาท : ทอน {}", price[0], total01);
  // println!("ชิ้นที่ 2 ราคา {} บาท : ทอน {}", price[1], total02);
  // println!("ชิ้นที่ 3 ราคา {} บาท : ทอน {}", price[2], total03);
  //------------------------8------------------------------

  // let food = vec!["ข้าวมันไก่", "ผัดกะเพรา","ราเม็ง"];
  // let price = vec![45, 50, 100];
  // println!("{} - {} บาท", food[0], price[0]);
  // println!("{} - {} บาท", food[1], price[1]);
  // println!("{} - {} บาท", food[2], price[2]);
  // -------------------------9------------------------
  // เริ่มฝึก loop ลดการทำซ้ำ นายจีพีทีแนะนำมาให้ลอง
  // for ใช้เมื่อต้องการทำไรซ้ำๆ เช่น วนดูแกงค์ใน index วนตัวเลข

  // let name = vec!["gus", "horn", "owen"];
  // for name in name {
  //     print!("ไง {} ", name);
  // }
  // -------------------------10------------------------

  // for i in 0..5  {
  //     println!("รอบที่ {}", i);
  // }
  // -----------------------------11---------------------

  //version loop

  // let food = vec!["ข้าวมันไก่", "ผัดกะเพรา","ราเม็ง"];
  // let price = vec![45, 50, 100];
  // for i in 0..food.len() {
  //     println!("{} - {} บาท", food[i], price[i]);
  // }





}
