// fn main() {
//     for i in 1..=100 { 
//         println!("{}", i+1);
//     }
// }
// ------------B1---------------

// fn main() {
//     let mut i = 100;
//     while i>= 1 {
//         println!("{}", i);
//         i -= 1;
//     }
// }
// ------------B2--------------

// fn main () {
//         for i in 1..=100 {
//              if i % 2 == 0 {
//                  println!("{}", i);
//              }
//         } 
// }
//-------------B3--------------

// fn main() {
//         for i in 1..=100 {
//                 if i % 3 == 0 {
//                         println!("{}", i);
//                 }
//         }
// }
//-------------B4--------------

// fn main() {
//         for i in 1..=100 {
//             if i % 3 == 0 {
//                 println!("{}", i);
//             }
//         }
// }
//-------------B5--------------
// fn main() {
//         for i in 1..=100 {
//             if i % 5 == 0 {
//                 println!("{}", i);
//             }
//         }
// }
//-------------B6--------------

// fn main() {
//     for i in 1..=100 {
//         if i % 3 == 0  && i % 5 == 0 {
//             println!("{}", i);
//         }        
//     }
// }
// ---------------B7--------------

// fn main() {
//     for i in 1..=100 {
//         if i % 3 == 0  || i % 5 == 0 {
//             println!("{}", i);
//         }        
//     }
// }

//----------------B8----------------

// fn main() {
//     for i in 1..=100 {
//         if (i % 3 == 0 || i % 5 == 0) && !(i % 3 == 0 && i % 5 == 0) {
//         println!("{}", i); 
//         }      
//     }
// }
//----------------B9----------------
// fn main() {
//     for i in 1..=1000 {
//         if (
//             (i % 3 == 0 && i % 5 == 0) || 
//             (i % 5 == 0 && i % 7 == 0) || 
//             (i % 7 == 0 && i % 3 == 0)
//            ) && !(i % 3 == 0 && i % 5 == 0 && i % 7 == 0) 
//         {
//             println!("{}", i);
//         }
//     }
// ------------------B10---------------
// fn main() {
//     for i in 1..=100 {
//             if 12 % i == 0 {
//             println!("{}", i);
//         }
//     }
// }
//---------------------F1----------------

// fn main() {
//         let mut count = 0;
//         for i in 1..=100 {
//                 if 6 % i == 0 {
//                     count +=1;
//                 }
//         }
//     println!("{} จำนวน", count);
// }

//-----------------F2------------------

// fn main() {
//     let mut count = 0;
//     for i in 1..=100 {
//         if 16 % i == 0 {
//             count += 1;
//         } 
//     }
//     if count == 2 {
//     println!("จำนวนเฉพาะ");
//     } else {
//     println!("ไม่ใช่จำนวนเฉพาะ");
// }
// }
//-----------------F3------------------

// fn main() {
//     let numbers = vec![20, 45, 12, 4, 8, 94, 43, 54, 74, 43];
//     for n in numbers {
//         let mut count = 0;
//         for i in 1..=n {
//             if n % i == 0 {
//                 count += 1;
//             }
//         }
//         if count == 2 {
//             println!("มีจำนวนเฉพาะ");
//             return;
//         }
//     }

//     println!("ไม่มีจำนวนเฉพาะ");
// }
//--------------------F4----------------

// fn main() {
//     for n in 1..100 {
//         let mut count = 0;
//         for i in 1..=n {
//             if n % i == 0 {
//                 count += 1;
//             }
//         }
//         if count == 2 {
//             println!("{}", n);
//         }
//     }
// }
//------------------F5---------------

// fn main() {
//     let mut n = 1;
//     let mut found = 0;

//     while found < 100 {
//         let mut count = 0;

//         for i in 1..=n {
//             if n % i == 0 {
//                 count += 1;
//             }
//         }

//         if count == 2 {
//             println!("{}", n);
//             found += 1;
//         }

//         n += 1;
//     }
// }
// //-------------------F5-----------------

// fn main() {
//     let time = 13;

//     if time < 12 {
//         println!("Good Morning");
//     } else {
//         println!("Good Afternoon");
//     }
// }

//------------------ตัวอย่าง2-------------------